export const advantagesOptions = [
  { number: 1, header: "Прямые поставки ", text: "Официальный дистрибьютор" },
  {
    number: 2,
    header: "Большой опыт",
    text: "Профессионалы с 15 летнимстажем",
  },
  {
    number: 3,
    header: "В ногу со временем",
    text: "Современное колеровочное оборудование",
  },
  { number: 4, header: "Масштабность", text: "Сеть магазинов по Кыргызстану" },
  {
    number: 5,
    header: "Богатый выбор",
    text: "Самый широкий ассортимент товаров ЛКМ",
  },
  {
    number: 6,
    header: " Экология о природе",
    text: "Экологически безопасная пролукиция",
  },
];
