export const catalogOptions = [
  'Краски, эмали для внутренних работ',
  'Краски, эмали универсальные',
  'Лаки и масла',
  'Штукатурки декоративные, фактурные краски',
  'Монтажные пены и очистители',
  'Готовые шпатлевки',
  'Растворители, очистители и спецсредства ',
  'Стеклохолст, малярный флизелин, обои под покраску',
  'Промышленные покрытия',
  'Краски, эмали для наружных работ',
  'Антисептики и пропитки для дерева',
  'Грунтовки',
  'Декоравтивные дизайнерские покрытия',
  'Клеи, герметики, гидроизоляция',
  'Сухие смеси',
  'Инструменты, краскопульты',
  'Эпоксидные полимерные покрытия “Сделай Пол”'
];
