<template>
    <section>
        <div class="header">
            <h1>
                Оплата и доставка
            </h1>
            <p>
                Вы можете получить выбранные товары самостоятельно, забрав из ближайшего к вам магазина.
                Или воспользоваться одним из способов доставки. Выберите тот способ, который больше вам подходит.
            </p>
        </div>
        <div class="delivery">
            <h1>Доставка в день заказа</h1>


            <div class="delivery-info">
                <div>
                    <span class="delivery-info-header">Мы доставим ваш заказ в день заказа, если:</span>
                    <ul class="list">
                        <li>Вы сделали заказ, и оплатили его банковской картой на сайте</li>
                        <li>Общий вес товаров в заказе менее 100 кг</li>
                        <li>Адрес доставки находится в пределах города Бишкек</li>
                        <li>Весь товар есть в наличии</li>
                        <li>Вы готовы оплатить услугу доставки курьеру наличными. Стоимость услуги от 200сом</li>
                    </ul>
                </div>
            </div>

            <div class="delivery-info">
                <div>
                    <span class="delivery-info-header">Мы доставим ваш заказ в день заказа, если:</span>
                    <ul class="list">
                        <li>Вы сделали заказ, и оплатили его банковской картой на сайте</li>
                        <li>Общий вес товаров в заказе менее 100 кг</li>
                        <li>Адрес доставки находится в пределах города Бишкек</li>
                        <li>Весь товар есть в наличии</li>
                        <li>Вы готовы оплатить услугу доставки курьеру наличными. Стоимость услуги от 200сом</li>
                    </ul>
                </div>
            </div>
        </div>


        <div class="delivery-from">
            <h1 class="delivery-header-h1">Самовывоз из магазинов торговой сети «Мастер Краска»</h1>
            <div><span class="delivery-info-header">Вы можете бесплатно зарезервировать и забрать заказ в магазинах
                    сети, если товар есть в наличии в выбранном магазине:</span>

                <ol class="list">
                    <li>Выберите нужные товары в каталоге Мастер Краска</li>
                    <li>Начните оформление заказа и выберите удобный для вас магазин</li>
                    <li>Вы получите номер заказа, после обработки менеджером вам придёт подтверждение по СМС или звонком
                        от оператора</li>
                    <li>
                        Зарезервированный товар снимается с резерва в 18–00 в день оформления заказа.
                    </li>
                    <p class="delivery-from-warning">Мы просим вас делать свои заказы заблаговременно и оставлять
                        правильную
                        контактную информацию: ФИО,
                        телефон, email, адрес доставки. Если менеджер не сможет дозвониться по указанному вами телефону
                        в течение 2 дней, заказ будет аннулирован. Если в этот период вы не сможете принять звонок,
                        пожалуйста, предупредите нас</p>
                </ol>


            </div>
        </div>


        <div class="delivery">
            <h1 class="delivery-header-h1 ">Правила доставки товаров</h1>


            <div class="delivery-info">

                <ul class="list">
                    <li>Товар доставляется в течение 1–2 рабочих дней с момента поступления заказа в службу
                        доставки, когда обработанный заказ поступил в службу доставки, а с заказчиком предварительно
                        связались. При безналичной оплате — в течение 1–2 рабочих дней с момента поступления средств
                        на наш счёт.</li>
                    <li>Заказы доставляются с понедельника по пятницу с 9:00 до 18:00, в соответствии с графиком,
                        согласованным с клиентом.</li>
                    <li>Возможна доставка в субботу. Для этого заказ должен быть оформлен до 18:00 пятницы
                        и обработан менеджером.</li>
                    <li>Срок доставки заказных позиций обсуждается с менеджерами отдельно.</li>
                    <li>
                        Колерованный товар отгружается только после 100% предоплаты заказа.
                    </li>
                    <li>Консультацию по доставке можно получить по телефону одного из магазинов.</li>
                    <li>Позаботьтесь о том, чтобы обеспечить машине «Мастер Краска» беспрепятственный подъезд
                        к месту разгрузки. В ином случае доставка будет осуществлена максимально близко к месту
                        планируемой выгрузки без нарушения ПДД и вероятности повреждения автомобиля.</li>
                </ul>

            </div>


        </div>


        <div class="delivery">
            <h1 class="delivery-header-h1 ">Оплата</h1>


            <div class="delivery-info">
                <span class="delivery-info-header">Возможны следующие варианты оплаты:</span>
                <ul class="list">
                    <li>
                        Наличными
                    </li>
                    <li>
                        Оплата банковской картой в магазинах «Мастер Краска»
                    </li>
                    <li>
                        Безналичный расчёт для организаций
                    </li>
                    <li>
                        Оплата пластиковыми картами онлайн на сайте
                    </li>
                    <li>Оплата через банк для физических лиц</li>
                    <li>
                        При покупке заказных позиций: предоплата наличными в ближайшем магазине «Мастер Краска»
                        или безналичным способом по счёту.
                    </li>
                    <li class="danger">
                        Внимание!
                    </li>
                    <li>
                        Колерованный товар обмену и возврату не подлежит. При отказе от колерованной продукции
                        её стоимость взимается в полном объёме.
                    </li>

                    <li>
                        Если вы по какой‑либо причине отказываетесь от покупки в момент получения заказа с доставкой,
                        стоимость доставки оплачивается в полном размере в соответствии с п. 3 ст. 460 ГК КР
                    </li>

                    <li>
                        Ознакомьтесь с правилами возврата товаров.
                    </li>
                    <li>Если вы не можете получить заказ в выбранное вами время, заранее свяжитесь по телефону
                        с менеджером, который оформил ваш заказ, и согласуйте другое время доставки.</li>
                </ul>

            </div>


        </div>
    </section>
</template>

<script setup lang="ts">

</script>

<style scoped lang="scss">
%each-li {
    list-style: disc !important;
    color: $main-dark-grey;
    @include textFormat(16px, 20px, 400, $main-dark-grey);
    margin-bottom: 12px;

}

.main-section-site {
    margin: 0 !important
}

.delivery-header-h1 {
    margin-top: 60px;
    margin-bottom: 20px;
    max-width: 680px;
}

.delivery-info-header {
    @include textFormat(20px, 20px, 600, $main-black);
    margin-bottom: 20px;
    display: block;
}


.delivery-from {
    .delivery-info-header {
        max-width: 600px;
        padding-left: 20px;
    }

    li {
        @extend %each-li
    }

    .list {
        padding-left: 40px;
    }

    &-warning {
        @include textFormat(16px, 20px, 500, $blue-color)
    }
}

.delivery {
    &-info {
        margin-top: 40px;


    }

    .danger {
        color: #EB5757;
        font-weight: 600;
    }


    li {
        @extend %each-li
    }
}

.header {
    margin-bottom: 80px;
    background-image: url('/static/close-up-hands-carrying-box\ 1.png');
    background-repeat: no-repeat;
    background-size: cover;
    height: 100vh;
    background-position: center center;
    width: 100%;
    @include flex(column, center, start);
    padding-left: 50px;

    h1 {
        margin: 20.9rem 0 50px 0;
        @include textFormat(74px !important, 101px, 600, #fff !important)
    }

    p {
        max-width: 625px;
        @include textFormat(20px !important, 27px, 500, #fff !important)
    }

}


.list {
    max-width: 600px;
    padding-left: 20px;
}

@media (min-width:768px) and (max-width:992px) {
    .header h1 {
        margin-top: 4rem;
        font-size: 60px !important
    }
}
</style>
